In [9]:
import pandas as pd

In [10]:
raw_data = {'city': ['Tripoli', 'Tripoli', 'Rome', 'Rome', 'Sydney', 'Sydney'], 
        'rank': ['1st', '2nd', '1st', '2nd', '1st', '2nd'], 
        'name': ['Noureddin', 'Adam', 'Kevin', 'Raihana', 'Raghad', 'Mahdi'], 
        'score1': [44, 48, 39, 41, 38, 44],
        'score2': [67, 63, 55, 70, 64, 77]}

In [11]:
df = pd.DataFrame(raw_data, columns = ['city', 'rank', 'name', 'score1', 'score2'])

In [19]:
df.to_csv('/home/noureddin/Downloads/data.csv',index=False,sep='\t')

In [20]:
df

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd    Raihana      41      70
4   Sydney  1st     Raghad      38      64
5   Sydney  2nd      Mahdi      44      77

In [23]:
df1 = pd.read_csv('/home/noureddin/Downloads/data.csv',sep='\t')

In [24]:
df1

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd    Raihana      41      70
4   Sydney  1st     Raghad      38      64
5   Sydney  2nd      Mahdi      44      77